package l10_1;

public class Programmer extends Profession {

    boolean haveHair;

    void stayUpLate() {
        System.out.println("我正在熬夜");
    }

    //重写
    @Override
    void work(){
        System.out.println("我正在打代码");
    }

    public Programmer(String name) {
        super();//输出父类构造
        super.name = name;
    }

    String getName() {
        super.work();
        return super.name;
    }

    public static void main(String[] args){
        Programmer programmer = new Programmer("aaa");
        programmer.work();

    }

}

/*


    ============================================================
    方法重写
    ============================================================

    【基本概念】

    重写是子类对父类的允许访问的方法的实现过程进行重新编写，
    形参不能改变。

    ============================================================


*/

/*

============================================================
方法重写（Override）
============================================================

============================================================
方法重写（Override）
============================================================

【重写规则】

1. 参数列表与被重写方法的参数列表必须完全相同；
2. 返回类型与被重写方法的返回类型可以不相同，但是必须是父类返回值的派生类；
3. 访问权限不能比父类中被重写的方法的访问权限更低；
   例：父类方法是 public，子类重写时不能是 protected；
4. 父类的成员方法只能被它的子类重写；
5. final 修饰的方法不能被重写；
6. static 修饰的方法不能被重写，但是能够被再次声明；
7. 子类和父类在同一个包中，子类可以重写父类所有方法（private 和 final 除外）；
8. 子类和父类不在同一个包中，子类只能重写父类 public 和 protected 的非 final 方法；
9. 重写的方法可以抛出任何非强制异常，但不能抛出新的或更广泛的强制性异常；
10. 构造方法不能被重写。

【重写的价值】

子类可以根据需要，定义特定于自己的行为。

============================================================

============================================================

*/