package l8;

public class OverloadTest {

    int sum(int a, int b) {
        return a + b;
    }

    int sum(int a, int b, int c) {
        return a + b + c;
    }

    int sum(double a, double b) {
        return (int)(a + b);
    }

    public static void main(String[] args) {
        OverloadTest test = new OverloadTest();

        //编译器会根据你传入的参数（个数、类型、顺序）自动去匹配最合适的那个方法。
        int result1 = test.sum(1, 2);        // 调用 2 个参数的方法
        int result2 = test.sum(1, 2, 3);     // 调用 3 个参数的方法
        int result3 = test.sum(1.6, 2.9);

        System.out.println("sum(1, 2) = " + result1);      // 3
        System.out.println("sum(1, 2, 3) = " + result2);   // 6
        System.out.println("sum(1, 2) = " + result3);   // 6
    }

}


/*


    int sum(int a, int b) { return a + b; }
    double sum(int a, int b) { return a + b; }   // ❌ 编译报错
    返回值类型不同能构成重载,但参数类型可以不同


*/


/*

    ============================================================
    重载 (Overloading)
        重载是在一个类里面，方法名字相同，而参数不同。
    ============================================================

*/


/*

    ============================================================
    方法重载（Overloading）
    ============================================================

    【基本规则】

    1. 被重载的方法必须改变参数列表（参数个数或类型不一样）；
    2. 被重载的方法可以改变返回类型；
    3. 被重载的方法可以改变访问修饰符；
    4. 被重载的方法可以声明新的或更广的检查异常；
    5. 方法能够在同一个类中或者在一个子类中被重载；
    6. 无法以返回值类型作为重载函数的区分标准。

    ============================================================

*/

/*


    ============================================================
    重载的价值
    ============================================================

    - 适应不同出入口，相同业务功能的方法需要。

    ============================================================


*/